In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "name":['sonu', 'rohan', 'rock', 'hist'],
    "marks":[90, 34, 24, 17],
    "city":['rampur', 'kolkata', 'chennai', 'mumbai']
}

In [4]:
df = pd.DataFrame(dict1)

In [5]:
df

    name  marks     city
0   sonu     90   rampur
1  rohan     34  kolkata
2   rock     24  chennai
3   hist     17   mumbai

In [6]:
df.to_csv('friends.csv')

In [8]:
df.to_csv('friends_index_false.csv', index=False)

In [9]:
df.head(2)

    name  marks     city
0   sonu     90   rampur
1  rohan     34  kolkata

In [10]:
df.tail(2)

   name  marks     city
2  rock     24  chennai
3  hist     17   mumbai

In [11]:
df.describe()

           marks
count   4.000000
mean   41.250000
std    33.240287
min    17.000000
25%    22.250000
50%    29.000000
75%    48.000000
max    90.000000

In [12]:
pd.read_csv('friends.csv')

    name  marks     city
0   sonu     90   rampur
1  rohan     34  kolkata
2   rock     24  chennai
3   hist     17   mumbai

In [13]:
df

    name  marks     city
0   sonu     90   rampur
1  rohan     34  kolkata
2   rock     24  chennai
3   hist     17   mumbai

In [14]:
df['name']

0     sonu
1    rohan
2     rock
3     hist
Name: name, dtype: object

In [15]:
df['marks']

0    90
1    34
2    24
3    17
Name: marks, dtype: int64

In [16]:
df['marks'][0]

90

In [17]:
df['city'][0]= 'kolkata'

<ipython-input-17-a49369968c08>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['city'][0]= 'kolkata'

In [18]:
df

    name  marks     city
0   sonu     90  kolkata
1  rohan     34  kolkata
2   rock     24  chennai
3   hist     17   mumbai

In [19]:
df.index = ['first', 'second', 'third', 'fourth']

In [20]:
df

         name  marks     city
first    sonu     90  kolkata
second  rohan     34  kolkata
third    rock     24  chennai
fourth   hist     17   mumbai

# Series

In [23]:
ser = pd.Series(np.random.rand(34))

In [24]:
ser

0     0.614684
1     0.393781
2     0.088632
3     0.304881
4     0.719522
5     0.298760
6     0.267440
7     0.472412
8     0.334238
9     0.581092
10    0.494560
11    0.484328
12    0.447399
13    0.513136
14    0.803242
15    0.323539
16    0.562802
17    0.573276
18    0.271726
19    0.903416
20    0.349117
21    0.125611
22    0.585412
23    0.200173
24    0.377337
25    0.511342
26    0.434531
27    0.312821
28    0.292541
29    0.586210
30    0.210208
31    0.782530
32    0.579221
33    0.317561
dtype: float64

In [25]:
type(ser)

pandas.core.series.Series

In [26]:
newdf = pd.DataFrame(np.random.rand(334, 5), index=np.arange(334))

In [27]:
newdf.head()

          0         1         2         3         4
0  0.331046  0.288230  0.618810  0.610473  0.630400
1  0.549615  0.551230  0.809850  0.937590  0.590516
2  0.320179  0.604773  0.528880  0.532698  0.064267
3  0.906357  0.073302  0.614587  0.484070  0.360308
4  0.180382  0.086987  0.208070  0.435624  0.720327

In [28]:
newdf

            0         1         2         3         4
0    0.331046  0.288230  0.618810  0.610473  0.630400
1    0.549615  0.551230  0.809850  0.937590  0.590516
2    0.320179  0.604773  0.528880  0.532698  0.064267
3    0.906357  0.073302  0.614587  0.484070  0.360308
4    0.180382  0.086987  0.208070  0.435624  0.720327
..        ...       ...       ...       ...       ...
329  0.815290  0.292655  0.380535  0.276991  0.341599
330  0.927582  0.786547  0.114443  0.440093  0.398865
331  0.718309  0.937652  0.801597  0.809722  0.409000
332  0.639153  0.447517  0.589736  0.435258  0.074790
333  0.877034  0.079063  0.386072  0.296996  0.373732

[334 rows x 5 columns]

In [29]:
type(newdf)

pandas.core.frame.DataFrame

In [30]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.504115    0.504911    0.481698    0.519647    0.501808
std      0.285631    0.287753    0.282847    0.293183    0.282549
min      0.001069    0.005027    0.003381    0.002824    0.008435
25%      0.271793    0.262927    0.263745    0.289609    0.262717
50%      0.496383    0.503526    0.461118    0.510688    0.493050
75%      0.743805    0.755363    0.714024    0.769471    0.730016
max      0.994229    0.998471    0.998139    0.998503    0.999019

In [32]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [33]:
newdf[0][0] = "Swarnava"

In [34]:
newdf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [35]:
newdf.head()

          0         1         2         3         4
0  Swarnava  0.288230  0.618810  0.610473  0.630400
1  0.549615  0.551230  0.809850  0.937590  0.590516
2  0.320179  0.604773  0.528880  0.532698  0.064267
3  0.906357  0.073302  0.614587  0.484070  0.360308
4  0.180382  0.086987  0.208070  0.435624  0.720327

In [36]:
newdf.index

Int64Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
            ...
            324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
           dtype='int64', length=334)

In [38]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [39]:
newdf.to_numpy()

array([['Swarnava', 0.28822989958330425, 0.6188102653936227,
        0.6104727613374119, 0.6303999980663231],
       [0.5496154063531772, 0.5512299898057113, 0.8098499441344833,
        0.9375904397586772, 0.5905156233986391],
       [0.32017879876185673, 0.6047729793990729, 0.5288797895393282,
        0.5326979188358709, 0.06426666007001103],
       ...,
       [0.7183086144117773, 0.9376516968914367, 0.8015968681483994,
        0.8097218927596794, 0.408999592399823],
       [0.6391527571813088, 0.44751726529187486, 0.5897361516435863,
        0.43525820501276147, 0.07479030606814252],
       [0.8770344741666176, 0.07906349201909935, 0.38607227716193304,
        0.29699626242049215, 0.3737315167964168]], dtype=object)

In [41]:
newdf[0][0] = 0.3

<ipython-input-41-452ed7015823>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newdf[0][0] = 0.3

In [42]:
newdf.head()

          0         1         2         3         4
0       0.3  0.288230  0.618810  0.610473  0.630400
1  0.549615  0.551230  0.809850  0.937590  0.590516
2  0.320179  0.604773  0.528880  0.532698  0.064267
3  0.906357  0.073302  0.614587  0.484070  0.360308
4  0.180382  0.086987  0.208070  0.435624  0.720327

In [43]:
newdf.to_numpy()

array([[0.3, 0.28822989958330425, 0.6188102653936227, 0.6104727613374119,
        0.6303999980663231],
       [0.5496154063531772, 0.5512299898057113, 0.8098499441344833,
        0.9375904397586772, 0.5905156233986391],
       [0.32017879876185673, 0.6047729793990729, 0.5288797895393282,
        0.5326979188358709, 0.06426666007001103],
       ...,
       [0.7183086144117773, 0.9376516968914367, 0.8015968681483994,
        0.8097218927596794, 0.408999592399823],
       [0.6391527571813088, 0.44751726529187486, 0.5897361516435863,
        0.43525820501276147, 0.07479030606814252],
       [0.8770344741666176, 0.07906349201909935, 0.38607227716193304,
        0.29699626242049215, 0.3737315167964168]], dtype=object)

In [44]:
newdf.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,0.3,0.549615,0.320179,0.906357,0.180382,0.972621,0.608405,0.810998,0.0016829,0.883947,...,0.153607,0.797163,0.788747,0.420391,0.0295279,0.81529,0.927582,0.718309,0.639153,0.877034
1,0.28823,0.55123,0.604773,0.0733019,0.0869872,0.587705,0.821054,0.805153,0.388759,0.416485,...,0.300913,0.342627,0.105371,0.499993,0.350932,0.292655,0.786547,0.937652,0.447517,0.0790635
2,0.61881,0.80985,0.52888,0.614587,0.20807,0.361339,0.334246,0.259357,0.973541,0.464051,...,0.377175,0.313384,0.505337,0.0799343,0.213344,0.380535,0.114443,0.801597,0.589736,0.386072
3,0.610473,0.93759,0.532698,0.48407,0.435624,0.893414,0.734218,0.737618,0.271153,0.0321665,...,0.276188,0.783622,0.386689,0.139916,0.866204,0.276991,0.440093,0.809722,0.435258,0.296996
4,0.6304,0.590516,0.0642667,0.360308,0.720327,0.492169,0.499978,0.526215,0.264134,0.814969,...,0.302167,0.751971,0.313469,0.678378,0.82171,0.341599,0.398865,0.409,0.0747903,0.373732

In [45]:
newdf

            0         1         2         3         4
0         0.3  0.288230  0.618810  0.610473  0.630400
1    0.549615  0.551230  0.809850  0.937590  0.590516
2    0.320179  0.604773  0.528880  0.532698  0.064267
3    0.906357  0.073302  0.614587  0.484070  0.360308
4    0.180382  0.086987  0.208070  0.435624  0.720327
..        ...       ...       ...       ...       ...
329   0.81529  0.292655  0.380535  0.276991  0.341599
330  0.927582  0.786547  0.114443  0.440093  0.398865
331  0.718309  0.937652  0.801597  0.809722  0.409000
332  0.639153  0.447517  0.589736  0.435258  0.074790
333  0.877034  0.079063  0.386072  0.296996  0.373732

[334 rows x 5 columns]

In [46]:
newdf.head()

          0         1         2         3         4
0       0.3  0.288230  0.618810  0.610473  0.630400
1  0.549615  0.551230  0.809850  0.937590  0.590516
2  0.320179  0.604773  0.528880  0.532698  0.064267
3  0.906357  0.073302  0.614587  0.484070  0.360308
4  0.180382  0.086987  0.208070  0.435624  0.720327

In [47]:
newdf.sort_index(axis=1, ascending=False)

            4         3         2         1         0
0    0.630400  0.610473  0.618810  0.288230       0.3
1    0.590516  0.937590  0.809850  0.551230  0.549615
2    0.064267  0.532698  0.528880  0.604773  0.320179
3    0.360308  0.484070  0.614587  0.073302  0.906357
4    0.720327  0.435624  0.208070  0.086987  0.180382
..        ...       ...       ...       ...       ...
329  0.341599  0.276991  0.380535  0.292655   0.81529
330  0.398865  0.440093  0.114443  0.786547  0.927582
331  0.409000  0.809722  0.801597  0.937652  0.718309
332  0.074790  0.435258  0.589736  0.447517  0.639153
333  0.373732  0.296996  0.386072  0.079063  0.877034

[334 rows x 5 columns]